# read design 
read_verilog pruebas.v

# high-level synthesis
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# write RTLIL design
write_verilog RTLIL.v

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty ./cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty ./cmos_cells.lib

#Numero de compontnetes y flip-flops
stat

# cleanup
clean


# write synthesized design
write_verilog synth.v
